Catalogs/НастройкиПодключенияКПлатежнымСистемам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкиПодключенияКПлатежнымСистемам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежнаяСистема</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПлатежныеСервисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НастройкиПодключенияКПлатежнымСистемам/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаСписка" Или ВидФормы = "ФормаВыбора" Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "Обработка.НастройкиПлатежныхСистем.Форма.Форма";
		НастройкиПлатежныхСистемСлужебный.ОбработкаПолученияФормыСписка(
			"Все",
			ВидФормы,
			Параметры);
			
	ИначеЕсли ВидФормы = "ФормаГруппы" Тогда
		
		ВызватьИсключение НСтр("ru = 'Изменение группы запрещено.'");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Сохраняет настройки подключения к платежной системе в информационную базу.
//
// Параметры:
//  ПараметрыЗаполнения - Структура - данные заполнения настройки подключения:
//    * Наименование - Строка - наименование настройки, отображаемое в списке.
//    * ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - идентификатор платежной системы.
//  ПараметрыАутентификации - Структура - данные аутентификации в сервисах платежной системы.
//  ПараметрыОплаты - Структура - содержит данные для записи настроек оплаты в регистр сведений.
//    Структура параметра соответствует структуре регистра, которая определена в метаданных за исключением полей
//    указанных в настройках в свойстве ИсключаемыеПоля процедуры
//    см. ПлатежныеСистемыПереопределяемый.ПриОпределенииНастроекПодключения.
//
// Возвращаемое значение:
//  Структура - результат создания настройки подключения:
//    * Ошибка - Булево - признак ошибки сохранения
//    * СообщениеОбОшибке - Строка - сообщение об ошибке для пользователя.
//    * Ссылка - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - ссылка на новую настройку.
//             - Неопределено - ошибка создания настройки
//
Функция НоваяНастройкаПодключения(ПараметрыЗаполнения, ПараметрыАутентификации, ПараметрыОплаты) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Ошибка"           , Ложь);
	Результат.Вставить("СообщениеОбОшибке", "");
	Результат.Вставить("Ссылка"           , Неопределено);
	
	НачатьТранзакцию();
	
	Попытка
		
		// Запись нового объекта
		НастройкаПодключения = СоздатьЭлемент();
		НастройкаПодключения.Заполнить(Неопределено);
		ЗаполнитьЗначенияСвойств(НастройкаПодключения, ПараметрыЗаполнения, "Наименование,ПлатежнаяСистема");
		НастройкаПодключения.Используется = Истина;
		
		НастройкаПодключения.Записать();
		
		РезультатЗаписиНастроек = ПлатежныеСистемыСлужебный.ЗаписатьНастройкиОплаты(
			ПараметрыОплаты,
			НастройкаПодключения.Ссылка,
			ПараметрыЗаполнения.ПлатежнаяСистема);
		Если РезультатЗаписиНастроек.Отказ Тогда
			Результат.Ошибка            = Истина;
			Результат.СообщениеОбОшибке = РезультатЗаписиНастроек.СообщениеОбОшибке;
			ОтменитьТранзакцию();
			Возврат Результат;
		КонецЕсли;
		
		ПлатежныеСистемыСлужебный.СохранитьНастройкиАутентификации(
			НастройкаПодключения.Ссылка,
			ПараметрыАутентификации);
		
		Результат.Ссылка = НастройкаПодключения.Ссылка;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		// Вызов во вложенной транзакции не предполагается, вместо вызова исключения обработка ошибки делегируется
		// вызывающему методу.
		Результат.Ошибка            = Истина;
		Результат.СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось записать настройку подключения по причине:
				|%1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ПлатежныеСистемыСлужебный.ЗаписатьИнформациюВЖурналРегистрации(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось записать настройку подключения к платежной системе %1.
					|%2'"),
				Строка(ПараметрыЗаполнения.ПлатежнаяСистема),
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())),
			Истина);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Определяет наличие настроек подключения к платежным системам.
//
// Параметры:
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - если нужно проверить наличие настроек подключения только
//                       для определенной платежной системы.
//                   - Неопределено - проверить наличие настройки подключения для любой платежной системы.
// 
// Возвращаемое значение:
//  Булево - если Истина, есть настройки подключения.
//
Функция ЕстьНастройкиПодключения(ПлатежнаяСистема = Неопределено) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Признак
	|ИЗ
	|	Справочник.НастройкиПодключенияКПлатежнымСистемам КАК НастройкиПодключенияКПлатежнымСистемам
	|ГДЕ
	|	&ПлатежнаяСистема";
	
	Если ЗначениеЗаполнено(ПлатежнаяСистема) Тогда
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"&ПлатежнаяСистема",
			"ПлатежнаяСистема = &ПлатежнаяСистема");
		Запрос.УстановитьПараметр("ПлатежнаяСистема", ПлатежнаяСистема);
	Иначе
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"&ПлатежнаяСистема",
			"ИСТИНА");
	КонецЕсли;
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Формирует параметры настройки подключения для выполнения запросов к сервису.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к сервису.
//
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//    * Ссылка - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам
//    * Используется - Булево - признак активности настройки.
//    * ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - идентификатор платежной системы.
//    * Наименование - Строка - наименование настройки.
//
Функция ПараметрыНастройкиПодключения(НастройкаПодключения) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиПодключенияКПлатежнымСистемам.Ссылка КАК Ссылка,
	|	НастройкиПодключенияКПлатежнымСистемам.Используется КАК Используется,
	|	НастройкиПодключенияКПлатежнымСистемам.ПлатежнаяСистема КАК ПлатежнаяСистема,
	|	НастройкиПодключенияКПлатежнымСистемам.Наименование
	|ИЗ
	|	Справочник.НастройкиПодключенияКПлатежнымСистемам КАК НастройкиПодключенияКПлатежнымСистемам
	|ГДЕ
	|	НастройкиПодключенияКПлатежнымСистемам.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", НастройкаПодключения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка;
	
КонецФункции

// Возвращает перечень настроек подключения.
//
// Параметры:
//  ВариантНастройки - ПеречислениеСсылка.ВариантыНастройкиСБП - вариант настройки Системы быстрых платежей.
//
// Возвращаемое значение:
//  Массив Из Структура - перечень настроек подключения и их параметров:
//    * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей - настройка подключения;
//    * Используется - Булево - признак активности настройки.
//    * ИдентификаторУчастника - Строка - Идентификатор участника СБП.
//
Функция НастройкиПодключенияПоСервису(ПлатежныйСервис) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиПодключенияКПлатежнымСистемам.Ссылка КАК Ссылка,
	|	НастройкиПодключенияКПлатежнымСистемам.Используется КАК Используется
	|ИЗ
	|	Справочник.НастройкиПодключенияКПлатежнымСистемам КАК НастройкиПодключенияКПлатежнымСистемам
	|ГДЕ
	|	НастройкиПодключенияКПлатежнымСистемам.ПлатежнаяСистема = &ПлатежныйСервис";
	
	Запрос.УстановитьПараметр("ПлатежныйСервис", ПлатежныйСервис);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОписаниеНастройки = Новый Структура;
		ОписаниеНастройки.Вставить("Ссылка", Выборка.Ссылка);
		ОписаниеНастройки.Вставить("Используется", Выборка.Используется);
		
		Результат.Добавить(ОписаниеНастройки);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
